program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.11.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios16>(tensor<fp32, [1, 3, 960, 960]> x) {
            tensor<fp32, [1]> initializers_onnx_initializer_135 = const()[name = tensor<string, []>("initializers_onnx_initializer_135"), val = tensor<fp32, [1]>([0x1.49c002p+0])];
            tensor<fp32, [1]> initializers_onnx_initializer_134 = const()[name = tensor<string, []>("initializers_onnx_initializer_134"), val = tensor<fp32, [1]>([0x1.226776p+2])];
            tensor<fp32, [1]> initializers_onnx_initializer_130 = const()[name = tensor<string, []>("initializers_onnx_initializer_130"), val = tensor<fp32, [1]>([-0x1.05361cp-14])];
            tensor<fp32, [1]> initializers_onnx_initializer_129 = const()[name = tensor<string, []>("initializers_onnx_initializer_129"), val = tensor<fp32, [1]>([0x1.5b302cp-3])];
            tensor<fp32, [1]> initializers_onnx_initializer_125 = const()[name = tensor<string, []>("initializers_onnx_initializer_125"), val = tensor<fp32, [1]>([0x1.53c3d6p-3])];
            tensor<fp32, [1]> initializers_onnx_initializer_124 = const()[name = tensor<string, []>("initializers_onnx_initializer_124"), val = tensor<fp32, [1]>([0x1.df336ep-1])];
            tensor<fp32, [1]> initializers_onnx_initializer_120 = const()[name = tensor<string, []>("initializers_onnx_initializer_120"), val = tensor<fp32, [1]>([-0x1.be6a2cp-14])];
            tensor<fp32, [1]> initializers_onnx_initializer_119 = const()[name = tensor<string, []>("initializers_onnx_initializer_119"), val = tensor<fp32, [1]>([0x1.2b5732p-3])];
            tensor<fp32, [1]> initializers_onnx_initializer_115 = const()[name = tensor<string, []>("initializers_onnx_initializer_115"), val = tensor<fp32, [1]>([0x1.086c74p-2])];
            tensor<fp32, [1]> initializers_onnx_initializer_114 = const()[name = tensor<string, []>("initializers_onnx_initializer_114"), val = tensor<fp32, [1]>([0x1.d6bc62p-1])];
            tensor<fp32, [1]> initializers_onnx_initializer_108 = const()[name = tensor<string, []>("initializers_onnx_initializer_108"), val = tensor<fp32, [1]>([-0x1.08ff8p+0])];
            tensor<fp32, [1]> initializers_onnx_initializer_107 = const()[name = tensor<string, []>("initializers_onnx_initializer_107"), val = tensor<fp32, [1]>([0x1.40e6dcp+0])];
            tensor<fp32, [1]> initializers_onnx_initializer_103 = const()[name = tensor<string, []>("initializers_onnx_initializer_103"), val = tensor<fp32, [1]>([0x1.1a9c0cp-3])];
            tensor<fp32, [1]> initializers_onnx_initializer_102 = const()[name = tensor<string, []>("initializers_onnx_initializer_102"), val = tensor<fp32, [1]>([0x1.ef98fep-1])];
            tensor<fp32, [1]> initializers_onnx_initializer_93 = const()[name = tensor<string, []>("initializers_onnx_initializer_93"), val = tensor<fp32, [1]>([0x1.753f7ap-3])];
            tensor<fp32, [1]> initializers_onnx_initializer_92 = const()[name = tensor<string, []>("initializers_onnx_initializer_92"), val = tensor<fp32, [1]>([0x1.5c828ap+0])];
            tensor<fp32, [1]> initializers_onnx_initializer_88 = const()[name = tensor<string, []>("initializers_onnx_initializer_88"), val = tensor<fp32, [1]>([0x1.e964eep-11])];
            tensor<fp32, [1]> initializers_onnx_initializer_87 = const()[name = tensor<string, []>("initializers_onnx_initializer_87"), val = tensor<fp32, [1]>([0x1.0367a2p-7])];
            tensor<fp32, [1]> initializers_onnx_initializer_83 = const()[name = tensor<string, []>("initializers_onnx_initializer_83"), val = tensor<fp32, [1]>([0x1.6b8e3ep-3])];
            tensor<fp32, [1]> initializers_onnx_initializer_82 = const()[name = tensor<string, []>("initializers_onnx_initializer_82"), val = tensor<fp32, [1]>([0x1.a4af12p-1])];
            tensor<fp32, [1]> initializers_onnx_initializer_78 = const()[name = tensor<string, []>("initializers_onnx_initializer_78"), val = tensor<fp32, [1]>([0x1.fae4e2p-11])];
            tensor<fp32, [1]> initializers_onnx_initializer_77 = const()[name = tensor<string, []>("initializers_onnx_initializer_77"), val = tensor<fp32, [1]>([0x1.4b45ap-8])];
            tensor<fp32, [1]> initializers_onnx_initializer_73 = const()[name = tensor<string, []>("initializers_onnx_initializer_73"), val = tensor<fp32, [1]>([0x1.8e104ep-5])];
            tensor<fp32, [1]> initializers_onnx_initializer_72 = const()[name = tensor<string, []>("initializers_onnx_initializer_72"), val = tensor<fp32, [1]>([0x1.75a3a2p-1])];
            tensor<fp32, [1]> initializers_onnx_initializer_68 = const()[name = tensor<string, []>("initializers_onnx_initializer_68"), val = tensor<fp32, [1]>([-0x1.1e3264p-12])];
            tensor<fp32, [1]> initializers_onnx_initializer_67 = const()[name = tensor<string, []>("initializers_onnx_initializer_67"), val = tensor<fp32, [1]>([0x1.b91dp-6])];
            tensor<fp32, [1]> initializers_onnx_initializer_63 = const()[name = tensor<string, []>("initializers_onnx_initializer_63"), val = tensor<fp32, [1]>([-0x1.cfe104p-4])];
            tensor<fp32, [1]> initializers_onnx_initializer_62 = const()[name = tensor<string, []>("initializers_onnx_initializer_62"), val = tensor<fp32, [1]>([0x1.94b6c8p-1])];
            tensor<fp32, [1]> initializers_onnx_initializer_58 = const()[name = tensor<string, []>("initializers_onnx_initializer_58"), val = tensor<fp32, [1]>([0x1.70ce3p-11])];
            tensor<fp32, [1]> initializers_onnx_initializer_57 = const()[name = tensor<string, []>("initializers_onnx_initializer_57"), val = tensor<fp32, [1]>([0x1.2f0226p-8])];
            tensor<fp32, [1]> initializers_onnx_initializer_53 = const()[name = tensor<string, []>("initializers_onnx_initializer_53"), val = tensor<fp32, [1]>([-0x1.a182ccp-1])];
            tensor<fp32, [1]> initializers_onnx_initializer_52 = const()[name = tensor<string, []>("initializers_onnx_initializer_52"), val = tensor<fp32, [1]>([0x1.4ec99cp-1])];
            tensor<fp32, [1]> initializers_onnx_initializer_45 = const()[name = tensor<string, []>("initializers_onnx_initializer_45"), val = tensor<fp32, [1]>([-0x1.d6e89p-5])];
            tensor<fp32, [1]> initializers_onnx_initializer_44 = const()[name = tensor<string, []>("initializers_onnx_initializer_44"), val = tensor<fp32, [1]>([0x1.8aaeecp+0])];
            tensor<fp32, [1]> initializers_onnx_initializer_40 = const()[name = tensor<string, []>("initializers_onnx_initializer_40"), val = tensor<fp32, [1]>([0x1.a026b8p-16])];
            tensor<fp32, [1]> initializers_onnx_initializer_39 = const()[name = tensor<string, []>("initializers_onnx_initializer_39"), val = tensor<fp32, [1]>([0x1.8c6c6ep-4])];
            tensor<fp32, [1]> initializers_onnx_initializer_35 = const()[name = tensor<string, []>("initializers_onnx_initializer_35"), val = tensor<fp32, [1]>([-0x1.e6ec1ep-1])];
            tensor<fp32, [1]> initializers_onnx_initializer_34 = const()[name = tensor<string, []>("initializers_onnx_initializer_34"), val = tensor<fp32, [1]>([0x1.1de53p-1])];
            tensor<fp32, [1]> initializers_onnx_initializer_27 = const()[name = tensor<string, []>("initializers_onnx_initializer_27"), val = tensor<fp32, [1]>([-0x1.1c2bbp-1])];
            tensor<fp32, [1]> initializers_onnx_initializer_26 = const()[name = tensor<string, []>("initializers_onnx_initializer_26"), val = tensor<fp32, [1]>([0x1.7fb94cp+0])];
            tensor<fp32, [1]> initializers_onnx_initializer_22 = const()[name = tensor<string, []>("initializers_onnx_initializer_22"), val = tensor<fp32, [1]>([-0x1.02461cp-15])];
            tensor<fp32, [1]> initializers_onnx_initializer_21 = const()[name = tensor<string, []>("initializers_onnx_initializer_21"), val = tensor<fp32, [1]>([0x1.82cfb4p-8])];
            tensor<fp32, [1]> initializers_onnx_initializer_17 = const()[name = tensor<string, []>("initializers_onnx_initializer_17"), val = tensor<fp32, [1]>([-0x1.be05d8p-1])];
            tensor<fp32, [1]> initializers_onnx_initializer_16 = const()[name = tensor<string, []>("initializers_onnx_initializer_16"), val = tensor<fp32, [1]>([0x1.7889bep-2])];
            tensor<fp32, [1]> initializers_onnx_initializer_9 = const()[name = tensor<string, []>("initializers_onnx_initializer_9"), val = tensor<fp32, [1]>([-0x1.d54bap-3])];
            tensor<fp32, [1]> initializers_onnx_initializer_8 = const()[name = tensor<string, []>("initializers_onnx_initializer_8"), val = tensor<fp32, [1]>([0x1.5ae306p-1])];
            tensor<fp32, [1]> initializers_onnx_initializer_4 = const()[name = tensor<string, []>("initializers_onnx_initializer_4"), val = tensor<fp32, [1]>([0x1.f19e0ep-13])];
            tensor<fp32, [1]> initializers_onnx_initializer_3 = const()[name = tensor<string, []>("initializers_onnx_initializer_3"), val = tensor<fp32, [1]>([0x1.570ff6p-8])];
            tensor<fp32, [48, 192, 1, 1]> Conv_22_weight = const()[name = tensor<string, []>("Conv_22_weight"), val = tensor<fp32, [48, 192, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp32, [96, 384, 1, 1]> Conv_26_weight = const()[name = tensor<string, []>("Conv_26_weight"), val = tensor<fp32, [96, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(36992)))];
            tensor<fp32, [12, 48, 1, 1]> Conv_33_weight = const()[name = tensor<string, []>("Conv_33_weight"), val = tensor<fp32, [12, 48, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(184512)))];
            tensor<fp32, [18, 96, 1, 1]> Conv_34_weight = const()[name = tensor<string, []>("Conv_34_weight"), val = tensor<fp32, [18, 96, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(186880)))];
            tensor<fp32, [42, 192, 1, 1]> Conv_35_weight = const()[name = tensor<string, []>("Conv_35_weight"), val = tensor<fp32, [42, 192, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(193856)))];
            tensor<fp32, [360, 384, 1, 1]> Conv_36_weight = const()[name = tensor<string, []>("Conv_36_weight"), val = tensor<fp32, [360, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(226176)))];
            tensor<fp32, [96, 360, 1, 1]> Conv_37_weight = const()[name = tensor<string, []>("Conv_37_weight"), val = tensor<fp32, [96, 360, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(779200)))];
            tensor<fp32, [24, 96, 1, 1]> Conv_38_weight = const()[name = tensor<string, []>("Conv_38_weight"), val = tensor<fp32, [24, 96, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(917504)))];
            tensor<fp32, [96, 42, 1, 1]> Conv_40_weight = const()[name = tensor<string, []>("Conv_40_weight"), val = tensor<fp32, [96, 42, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(926784)))];
            tensor<fp32, [24, 96, 1, 1]> Conv_41_weight = const()[name = tensor<string, []>("Conv_41_weight"), val = tensor<fp32, [24, 96, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(942976)))];
            tensor<fp32, [96, 18, 1, 1]> Conv_43_weight = const()[name = tensor<string, []>("Conv_43_weight"), val = tensor<fp32, [96, 18, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(952256)))];
            tensor<fp32, [24, 96, 1, 1]> Conv_44_weight = const()[name = tensor<string, []>("Conv_44_weight"), val = tensor<fp32, [24, 96, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(959232)))];
            tensor<fp32, [96, 12, 1, 1]> Conv_46_weight = const()[name = tensor<string, []>("Conv_46_weight"), val = tensor<fp32, [96, 12, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(968512)))];
            tensor<fp32, [24, 96, 1, 1]> Conv_47_weight = const()[name = tensor<string, []>("Conv_47_weight"), val = tensor<fp32, [24, 96, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(973184)))];
            tensor<fp32, [24, 96, 3, 3]> Conv_49_weight = const()[name = tensor<string, []>("Conv_49_weight"), val = tensor<fp32, [24, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(982464)))];
            tensor<fp32, [6, 24, 1, 1]> Conv_50_weight = const()[name = tensor<string, []>("Conv_50_weight"), val = tensor<fp32, [6, 24, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1065472)))];
            tensor<fp32, [24, 96, 3, 3]> Conv_52_weight = const()[name = tensor<string, []>("Conv_52_weight"), val = tensor<fp32, [24, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1066112)))];
            tensor<fp32, [6, 24, 1, 1]> Conv_53_weight = const()[name = tensor<string, []>("Conv_53_weight"), val = tensor<fp32, [6, 24, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1149120)))];
            tensor<fp32, [24, 96, 3, 3]> Conv_55_weight = const()[name = tensor<string, []>("Conv_55_weight"), val = tensor<fp32, [24, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1149760)))];
            tensor<fp32, [6, 24, 1, 1]> Conv_56_weight = const()[name = tensor<string, []>("Conv_56_weight"), val = tensor<fp32, [6, 24, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1232768)))];
            tensor<fp32, [24, 96, 3, 3]> Conv_58_weight = const()[name = tensor<string, []>("Conv_58_weight"), val = tensor<fp32, [24, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1233408)))];
            tensor<fp32, [6, 24, 1, 1]> Conv_59_weight = const()[name = tensor<string, []>("Conv_59_weight"), val = tensor<fp32, [6, 24, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1316416)))];
            tensor<fp32, [24, 1, 2, 2]> ConvTranspose_2_weight = const()[name = tensor<string, []>("ConvTranspose_2_weight"), val = tensor<fp32, [24, 1, 2, 2]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1317056)))];
            tensor<string, []> input_1_pad_type_0 = const()[name = tensor<string, []>("input_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_1_strides_0 = const()[name = tensor<string, []>("input_1_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_1_dilations_0 = const()[name = tensor<string, []>("input_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_1_groups_0 = const()[name = tensor<string, []>("input_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [16, 3, 3, 3]> const_54 = const()[name = tensor<string, []>("const_54"), val = tensor<fp32, [16, 3, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1317504)))];
            tensor<fp32, [16]> const_55 = const()[name = tensor<string, []>("const_55"), val = tensor<fp32, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1319296)))];
            tensor<fp32, [1, 16, 480, 480]> input_3 = conv(bias = const_55, dilations = input_1_dilations_0, groups = input_1_groups_0, pad = input_1_pad_0, pad_type = input_1_pad_type_0, strides = input_1_strides_0, weight = const_54, x = x)[name = tensor<string, []>("input_3")];
            tensor<string, []> first_1_pad_type_0 = const()[name = tensor<string, []>("first_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> first_1_pad_0 = const()[name = tensor<string, []>("first_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> first_1_groups_0 = const()[name = tensor<string, []>("first_1_groups_0"), val = tensor<int32, []>(16)];
            tensor<int32, [2]> first_1_strides_0 = const()[name = tensor<string, []>("first_1_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> first_1_dilations_0 = const()[name = tensor<string, []>("first_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp32, [16, 1, 3, 3]> x_3_weight_0 = const()[name = tensor<string, []>("x_3_weight_0"), val = tensor<fp32, [16, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1319424)))];
            tensor<fp32, [16]> const_60 = const()[name = tensor<string, []>("const_60"), val = tensor<fp32, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1320064)))];
            tensor<fp32, [1, 16, 480, 480]> x_5 = conv(bias = const_60, dilations = first_1_dilations_0, groups = first_1_groups_0, pad = first_1_pad_0, pad_type = first_1_pad_type_0, strides = first_1_strides_0, weight = x_3_weight_0, x = input_3)[name = tensor<string, []>("x_5")];
            tensor<fp32, []> var_429 = const()[name = tensor<string, []>("op_429"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_430 = const()[name = tensor<string, []>("op_430"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_432 = const()[name = tensor<string, []>("op_432"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [1, 16, 480, 480]> var_433 = mul(x = x_5, y = var_432)[name = tensor<string, []>("op_433")];
            tensor<fp32, []> var_434 = const()[name = tensor<string, []>("op_434"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [1, 16, 480, 480]> var_435 = add(x = var_433, y = var_434)[name = tensor<string, []>("op_435")];
            tensor<fp32, [1, 16, 480, 480]> clip_0 = clip(alpha = var_430, beta = var_429, x = var_435)[name = tensor<string, []>("clip_0")];
            tensor<fp32, [1, 16, 480, 480]> second_7 = mul(x = clip_0, y = x_5)[name = tensor<string, []>("second_7")];
            tensor<fp32, [1, 16, 480, 480]> x_7 = mul(x = initializers_onnx_initializer_3, y = second_7)[name = tensor<string, []>("x_7")];
            tensor<fp32, [1, 16, 480, 480]> x_9 = add(x = x_7, y = initializers_onnx_initializer_4)[name = tensor<string, []>("x_9")];
            tensor<string, []> first_13_pad_type_0 = const()[name = tensor<string, []>("first_13_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> first_13_strides_0 = const()[name = tensor<string, []>("first_13_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> first_13_pad_0 = const()[name = tensor<string, []>("first_13_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> first_13_dilations_0 = const()[name = tensor<string, []>("first_13_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> first_13_groups_0 = const()[name = tensor<string, []>("first_13_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [32, 16, 1, 1]> x_13_weight_0 = const()[name = tensor<string, []>("x_13_weight_0"), val = tensor<fp32, [32, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1320192)))];
            tensor<fp32, [32]> const_61 = const()[name = tensor<string, []>("const_61"), val = tensor<fp32, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1322304)))];
            tensor<fp32, [1, 32, 480, 480]> x_15 = conv(bias = const_61, dilations = first_13_dilations_0, groups = first_13_groups_0, pad = first_13_pad_0, pad_type = first_13_pad_type_0, strides = first_13_strides_0, weight = x_13_weight_0, x = x_9)[name = tensor<string, []>("x_15")];
            tensor<fp32, []> var_467 = const()[name = tensor<string, []>("op_467"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_468 = const()[name = tensor<string, []>("op_468"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_470 = const()[name = tensor<string, []>("op_470"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [1, 32, 480, 480]> var_471 = mul(x = x_15, y = var_470)[name = tensor<string, []>("op_471")];
            tensor<fp32, []> var_472 = const()[name = tensor<string, []>("op_472"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [1, 32, 480, 480]> var_473 = add(x = var_471, y = var_472)[name = tensor<string, []>("op_473")];
            tensor<fp32, [1, 32, 480, 480]> clip_1 = clip(alpha = var_468, beta = var_467, x = var_473)[name = tensor<string, []>("clip_1")];
            tensor<fp32, [1, 32, 480, 480]> second_17 = mul(x = clip_1, y = x_15)[name = tensor<string, []>("second_17")];
            tensor<fp32, [1, 32, 480, 480]> x_17 = mul(x = initializers_onnx_initializer_8, y = second_17)[name = tensor<string, []>("x_17")];
            tensor<fp32, [1, 32, 480, 480]> x_19 = add(x = x_17, y = initializers_onnx_initializer_9)[name = tensor<string, []>("x_19")];
            tensor<string, []> first_25_pad_type_0 = const()[name = tensor<string, []>("first_25_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> first_25_pad_0 = const()[name = tensor<string, []>("first_25_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> first_25_strides_0 = const()[name = tensor<string, []>("first_25_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, []> first_25_groups_0 = const()[name = tensor<string, []>("first_25_groups_0"), val = tensor<int32, []>(32)];
            tensor<int32, [2]> first_25_dilations_0 = const()[name = tensor<string, []>("first_25_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp32, [32, 1, 3, 3]> x_23_weight_0 = const()[name = tensor<string, []>("x_23_weight_0"), val = tensor<fp32, [32, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1322496)))];
            tensor<fp32, [32]> const_62 = const()[name = tensor<string, []>("const_62"), val = tensor<fp32, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1323712)))];
            tensor<fp32, [1, 32, 240, 240]> x_25 = conv(bias = const_62, dilations = first_25_dilations_0, groups = first_25_groups_0, pad = first_25_pad_0, pad_type = first_25_pad_type_0, strides = first_25_strides_0, weight = x_23_weight_0, x = x_19)[name = tensor<string, []>("x_25")];
            tensor<string, []> first_31_pad_type_0 = const()[name = tensor<string, []>("first_31_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> first_31_strides_0 = const()[name = tensor<string, []>("first_31_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> first_31_pad_0 = const()[name = tensor<string, []>("first_31_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> first_31_dilations_0 = const()[name = tensor<string, []>("first_31_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> first_31_groups_0 = const()[name = tensor<string, []>("first_31_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [48, 32, 1, 1]> x_29_weight_0 = const()[name = tensor<string, []>("x_29_weight_0"), val = tensor<fp32, [48, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1323904)))];
            tensor<fp32, [48]> const_63 = const()[name = tensor<string, []>("const_63"), val = tensor<fp32, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1330112)))];
            tensor<fp32, [1, 48, 240, 240]> x_31 = conv(bias = const_63, dilations = first_31_dilations_0, groups = first_31_groups_0, pad = first_31_pad_0, pad_type = first_31_pad_type_0, strides = first_31_strides_0, weight = x_29_weight_0, x = x_25)[name = tensor<string, []>("x_31")];
            tensor<fp32, []> var_529 = const()[name = tensor<string, []>("op_529"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_530 = const()[name = tensor<string, []>("op_530"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_532 = const()[name = tensor<string, []>("op_532"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [1, 48, 240, 240]> var_533 = mul(x = x_31, y = var_532)[name = tensor<string, []>("op_533")];
            tensor<fp32, []> var_534 = const()[name = tensor<string, []>("op_534"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [1, 48, 240, 240]> var_535 = add(x = var_533, y = var_534)[name = tensor<string, []>("op_535")];
            tensor<fp32, [1, 48, 240, 240]> clip_2 = clip(alpha = var_530, beta = var_529, x = var_535)[name = tensor<string, []>("clip_2")];
            tensor<fp32, [1, 48, 240, 240]> second_33 = mul(x = clip_2, y = x_31)[name = tensor<string, []>("second_33")];
            tensor<fp32, [1, 48, 240, 240]> x_33 = mul(x = initializers_onnx_initializer_16, y = second_33)[name = tensor<string, []>("x_33")];
            tensor<fp32, [1, 48, 240, 240]> x_35 = add(x = x_33, y = initializers_onnx_initializer_17)[name = tensor<string, []>("x_35")];
            tensor<string, []> first_43_pad_type_0 = const()[name = tensor<string, []>("first_43_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> first_43_pad_0 = const()[name = tensor<string, []>("first_43_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> first_43_groups_0 = const()[name = tensor<string, []>("first_43_groups_0"), val = tensor<int32, []>(48)];
            tensor<int32, [2]> first_43_strides_0 = const()[name = tensor<string, []>("first_43_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> first_43_dilations_0 = const()[name = tensor<string, []>("first_43_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp32, [48, 1, 3, 3]> x_39_weight_0 = const()[name = tensor<string, []>("x_39_weight_0"), val = tensor<fp32, [48, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1330368)))];
            tensor<fp32, [48]> const_64 = const()[name = tensor<string, []>("const_64"), val = tensor<fp32, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1332160)))];
            tensor<fp32, [1, 48, 240, 240]> x_41 = conv(bias = const_64, dilations = first_43_dilations_0, groups = first_43_groups_0, pad = first_43_pad_0, pad_type = first_43_pad_type_0, strides = first_43_strides_0, weight = x_39_weight_0, x = x_35)[name = tensor<string, []>("x_41")];
            tensor<fp32, []> var_568 = const()[name = tensor<string, []>("op_568"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_569 = const()[name = tensor<string, []>("op_569"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_571 = const()[name = tensor<string, []>("op_571"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [1, 48, 240, 240]> var_572 = mul(x = x_41, y = var_571)[name = tensor<string, []>("op_572")];
            tensor<fp32, []> var_573 = const()[name = tensor<string, []>("op_573"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [1, 48, 240, 240]> var_574 = add(x = var_572, y = var_573)[name = tensor<string, []>("op_574")];
            tensor<fp32, [1, 48, 240, 240]> clip_3 = clip(alpha = var_569, beta = var_568, x = var_574)[name = tensor<string, []>("clip_3")];
            tensor<fp32, [1, 48, 240, 240]> second_43 = mul(x = clip_3, y = x_41)[name = tensor<string, []>("second_43")];
            tensor<fp32, [1, 48, 240, 240]> x_43 = mul(x = initializers_onnx_initializer_21, y = second_43)[name = tensor<string, []>("x_43")];
            tensor<fp32, [1, 48, 240, 240]> x_45 = add(x = x_43, y = initializers_onnx_initializer_22)[name = tensor<string, []>("x_45")];
            tensor<string, []> first_55_pad_type_0 = const()[name = tensor<string, []>("first_55_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> first_55_strides_0 = const()[name = tensor<string, []>("first_55_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> first_55_pad_0 = const()[name = tensor<string, []>("first_55_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> first_55_dilations_0 = const()[name = tensor<string, []>("first_55_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> first_55_groups_0 = const()[name = tensor<string, []>("first_55_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [48, 48, 1, 1]> x_49_weight_0 = const()[name = tensor<string, []>("x_49_weight_0"), val = tensor<fp32, [48, 48, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1332416)))];
            tensor<fp32, [48]> const_65 = const()[name = tensor<string, []>("const_65"), val = tensor<fp32, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1341696)))];
            tensor<fp32, [1, 48, 240, 240]> x_51 = conv(bias = const_65, dilations = first_55_dilations_0, groups = first_55_groups_0, pad = first_55_pad_0, pad_type = first_55_pad_type_0, strides = first_55_strides_0, weight = x_49_weight_0, x = x_45)[name = tensor<string, []>("x_51")];
            tensor<fp32, []> var_606 = const()[name = tensor<string, []>("op_606"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_607 = const()[name = tensor<string, []>("op_607"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_609 = const()[name = tensor<string, []>("op_609"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [1, 48, 240, 240]> var_610 = mul(x = x_51, y = var_609)[name = tensor<string, []>("op_610")];
            tensor<fp32, []> var_611 = const()[name = tensor<string, []>("op_611"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [1, 48, 240, 240]> var_612 = add(x = var_610, y = var_611)[name = tensor<string, []>("op_612")];
            tensor<fp32, [1, 48, 240, 240]> clip_4 = clip(alpha = var_607, beta = var_606, x = var_612)[name = tensor<string, []>("clip_4")];
            tensor<fp32, [1, 48, 240, 240]> second_53 = mul(x = clip_4, y = x_51)[name = tensor<string, []>("second_53")];
            tensor<fp32, [1, 48, 240, 240]> x_53 = mul(x = initializers_onnx_initializer_26, y = second_53)[name = tensor<string, []>("x_53")];
            tensor<fp32, [1, 48, 240, 240]> x_55 = add(x = x_53, y = initializers_onnx_initializer_27)[name = tensor<string, []>("x_55")];
            tensor<string, []> first_67_pad_type_0 = const()[name = tensor<string, []>("first_67_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> first_67_pad_0 = const()[name = tensor<string, []>("first_67_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> first_67_strides_0 = const()[name = tensor<string, []>("first_67_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, []> first_67_groups_0 = const()[name = tensor<string, []>("first_67_groups_0"), val = tensor<int32, []>(48)];
            tensor<int32, [2]> first_67_dilations_0 = const()[name = tensor<string, []>("first_67_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp32, [48, 1, 3, 3]> x_59_weight_0 = const()[name = tensor<string, []>("x_59_weight_0"), val = tensor<fp32, [48, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1341952)))];
            tensor<fp32, [48]> const_66 = const()[name = tensor<string, []>("const_66"), val = tensor<fp32, [48]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1343744)))];
            tensor<fp32, [1, 48, 120, 120]> x_61 = conv(bias = const_66, dilations = first_67_dilations_0, groups = first_67_groups_0, pad = first_67_pad_0, pad_type = first_67_pad_type_0, strides = first_67_strides_0, weight = x_59_weight_0, x = x_55)[name = tensor<string, []>("x_61")];
            tensor<string, []> first_73_pad_type_0 = const()[name = tensor<string, []>("first_73_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> first_73_strides_0 = const()[name = tensor<string, []>("first_73_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> first_73_pad_0 = const()[name = tensor<string, []>("first_73_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> first_73_dilations_0 = const()[name = tensor<string, []>("first_73_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> first_73_groups_0 = const()[name = tensor<string, []>("first_73_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [96, 48, 1, 1]> x_65_weight_0 = const()[name = tensor<string, []>("x_65_weight_0"), val = tensor<fp32, [96, 48, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1344000)))];
            tensor<fp32, [96]> const_67 = const()[name = tensor<string, []>("const_67"), val = tensor<fp32, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1362496)))];
            tensor<fp32, [1, 96, 120, 120]> x_67 = conv(bias = const_67, dilations = first_73_dilations_0, groups = first_73_groups_0, pad = first_73_pad_0, pad_type = first_73_pad_type_0, strides = first_73_strides_0, weight = x_65_weight_0, x = x_61)[name = tensor<string, []>("x_67")];
            tensor<fp32, []> var_668 = const()[name = tensor<string, []>("op_668"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_669 = const()[name = tensor<string, []>("op_669"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_671 = const()[name = tensor<string, []>("op_671"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [1, 96, 120, 120]> var_672 = mul(x = x_67, y = var_671)[name = tensor<string, []>("op_672")];
            tensor<fp32, []> var_673 = const()[name = tensor<string, []>("op_673"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [1, 96, 120, 120]> var_674 = add(x = var_672, y = var_673)[name = tensor<string, []>("op_674")];
            tensor<fp32, [1, 96, 120, 120]> clip_5 = clip(alpha = var_669, beta = var_668, x = var_674)[name = tensor<string, []>("clip_5")];
            tensor<fp32, [1, 96, 120, 120]> second_69 = mul(x = clip_5, y = x_67)[name = tensor<string, []>("second_69")];
            tensor<fp32, [1, 96, 120, 120]> x_69 = mul(x = initializers_onnx_initializer_34, y = second_69)[name = tensor<string, []>("x_69")];
            tensor<fp32, [1, 96, 120, 120]> x_71 = add(x = x_69, y = initializers_onnx_initializer_35)[name = tensor<string, []>("x_71")];
            tensor<string, []> first_85_pad_type_0 = const()[name = tensor<string, []>("first_85_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> first_85_pad_0 = const()[name = tensor<string, []>("first_85_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> first_85_groups_0 = const()[name = tensor<string, []>("first_85_groups_0"), val = tensor<int32, []>(96)];
            tensor<int32, [2]> first_85_strides_0 = const()[name = tensor<string, []>("first_85_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> first_85_dilations_0 = const()[name = tensor<string, []>("first_85_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp32, [96, 1, 3, 3]> x_75_weight_0 = const()[name = tensor<string, []>("x_75_weight_0"), val = tensor<fp32, [96, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1362944)))];
            tensor<fp32, [96]> const_68 = const()[name = tensor<string, []>("const_68"), val = tensor<fp32, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1366464)))];
            tensor<fp32, [1, 96, 120, 120]> x_77 = conv(bias = const_68, dilations = first_85_dilations_0, groups = first_85_groups_0, pad = first_85_pad_0, pad_type = first_85_pad_type_0, strides = first_85_strides_0, weight = x_75_weight_0, x = x_71)[name = tensor<string, []>("x_77")];
            tensor<fp32, []> var_707 = const()[name = tensor<string, []>("op_707"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_708 = const()[name = tensor<string, []>("op_708"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_710 = const()[name = tensor<string, []>("op_710"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [1, 96, 120, 120]> var_711 = mul(x = x_77, y = var_710)[name = tensor<string, []>("op_711")];
            tensor<fp32, []> var_712 = const()[name = tensor<string, []>("op_712"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [1, 96, 120, 120]> var_713 = add(x = var_711, y = var_712)[name = tensor<string, []>("op_713")];
            tensor<fp32, [1, 96, 120, 120]> clip_6 = clip(alpha = var_708, beta = var_707, x = var_713)[name = tensor<string, []>("clip_6")];
            tensor<fp32, [1, 96, 120, 120]> second_79 = mul(x = clip_6, y = x_77)[name = tensor<string, []>("second_79")];
            tensor<fp32, [1, 96, 120, 120]> x_79 = mul(x = initializers_onnx_initializer_39, y = second_79)[name = tensor<string, []>("x_79")];
            tensor<fp32, [1, 96, 120, 120]> x_81 = add(x = x_79, y = initializers_onnx_initializer_40)[name = tensor<string, []>("x_81")];
            tensor<string, []> first_97_pad_type_0 = const()[name = tensor<string, []>("first_97_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> first_97_strides_0 = const()[name = tensor<string, []>("first_97_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> first_97_pad_0 = const()[name = tensor<string, []>("first_97_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> first_97_dilations_0 = const()[name = tensor<string, []>("first_97_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> first_97_groups_0 = const()[name = tensor<string, []>("first_97_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [96, 96, 1, 1]> x_85_weight_0 = const()[name = tensor<string, []>("x_85_weight_0"), val = tensor<fp32, [96, 96, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1366912)))];
            tensor<fp32, [96]> const_69 = const()[name = tensor<string, []>("const_69"), val = tensor<fp32, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1403840)))];
            tensor<fp32, [1, 96, 120, 120]> x_87 = conv(bias = const_69, dilations = first_97_dilations_0, groups = first_97_groups_0, pad = first_97_pad_0, pad_type = first_97_pad_type_0, strides = first_97_strides_0, weight = x_85_weight_0, x = x_81)[name = tensor<string, []>("x_87")];
            tensor<fp32, []> var_745 = const()[name = tensor<string, []>("op_745"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_746 = const()[name = tensor<string, []>("op_746"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_748 = const()[name = tensor<string, []>("op_748"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [1, 96, 120, 120]> var_749 = mul(x = x_87, y = var_748)[name = tensor<string, []>("op_749")];
            tensor<fp32, []> var_750 = const()[name = tensor<string, []>("op_750"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [1, 96, 120, 120]> var_751 = add(x = var_749, y = var_750)[name = tensor<string, []>("op_751")];
            tensor<fp32, [1, 96, 120, 120]> clip_7 = clip(alpha = var_746, beta = var_745, x = var_751)[name = tensor<string, []>("clip_7")];
            tensor<fp32, [1, 96, 120, 120]> second_89 = mul(x = clip_7, y = x_87)[name = tensor<string, []>("second_89")];
            tensor<fp32, [1, 96, 120, 120]> x_89 = mul(x = initializers_onnx_initializer_44, y = second_89)[name = tensor<string, []>("x_89")];
            tensor<fp32, [1, 96, 120, 120]> x_91 = add(x = x_89, y = initializers_onnx_initializer_45)[name = tensor<string, []>("x_91")];
            tensor<string, []> first_109_pad_type_0 = const()[name = tensor<string, []>("first_109_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> first_109_pad_0 = const()[name = tensor<string, []>("first_109_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> first_109_strides_0 = const()[name = tensor<string, []>("first_109_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, []> first_109_groups_0 = const()[name = tensor<string, []>("first_109_groups_0"), val = tensor<int32, []>(96)];
            tensor<int32, [2]> first_109_dilations_0 = const()[name = tensor<string, []>("first_109_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp32, [96, 1, 3, 3]> x_95_weight_0 = const()[name = tensor<string, []>("x_95_weight_0"), val = tensor<fp32, [96, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1404288)))];
            tensor<fp32, [96]> const_70 = const()[name = tensor<string, []>("const_70"), val = tensor<fp32, [96]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1407808)))];
            tensor<fp32, [1, 96, 60, 60]> x_97 = conv(bias = const_70, dilations = first_109_dilations_0, groups = first_109_groups_0, pad = first_109_pad_0, pad_type = first_109_pad_type_0, strides = first_109_strides_0, weight = x_95_weight_0, x = x_91)[name = tensor<string, []>("x_97")];
            tensor<string, []> first_115_pad_type_0 = const()[name = tensor<string, []>("first_115_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> first_115_strides_0 = const()[name = tensor<string, []>("first_115_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> first_115_pad_0 = const()[name = tensor<string, []>("first_115_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> first_115_dilations_0 = const()[name = tensor<string, []>("first_115_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> first_115_groups_0 = const()[name = tensor<string, []>("first_115_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [192, 96, 1, 1]> x_101_weight_0 = const()[name = tensor<string, []>("x_101_weight_0"), val = tensor<fp32, [192, 96, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1408256)))];
            tensor<fp32, [192]> const_71 = const()[name = tensor<string, []>("const_71"), val = tensor<fp32, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1482048)))];
            tensor<fp32, [1, 192, 60, 60]> x_103 = conv(bias = const_71, dilations = first_115_dilations_0, groups = first_115_groups_0, pad = first_115_pad_0, pad_type = first_115_pad_type_0, strides = first_115_strides_0, weight = x_101_weight_0, x = x_97)[name = tensor<string, []>("x_103")];
            tensor<fp32, []> var_807 = const()[name = tensor<string, []>("op_807"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_808 = const()[name = tensor<string, []>("op_808"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_810 = const()[name = tensor<string, []>("op_810"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [1, 192, 60, 60]> var_811 = mul(x = x_103, y = var_810)[name = tensor<string, []>("op_811")];
            tensor<fp32, []> var_812 = const()[name = tensor<string, []>("op_812"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [1, 192, 60, 60]> var_813 = add(x = var_811, y = var_812)[name = tensor<string, []>("op_813")];
            tensor<fp32, [1, 192, 60, 60]> clip_8 = clip(alpha = var_808, beta = var_807, x = var_813)[name = tensor<string, []>("clip_8")];
            tensor<fp32, [1, 192, 60, 60]> second_105 = mul(x = clip_8, y = x_103)[name = tensor<string, []>("second_105")];
            tensor<fp32, [1, 192, 60, 60]> x_105 = mul(x = initializers_onnx_initializer_52, y = second_105)[name = tensor<string, []>("x_105")];
            tensor<fp32, [1, 192, 60, 60]> x_107 = add(x = x_105, y = initializers_onnx_initializer_53)[name = tensor<string, []>("x_107")];
            tensor<string, []> first_127_pad_type_0 = const()[name = tensor<string, []>("first_127_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> first_127_pad_0 = const()[name = tensor<string, []>("first_127_pad_0"), val = tensor<int32, [4]>([2, 2, 2, 2])];
            tensor<int32, []> first_127_groups_0 = const()[name = tensor<string, []>("first_127_groups_0"), val = tensor<int32, []>(192)];
            tensor<int32, [2]> first_127_strides_0 = const()[name = tensor<string, []>("first_127_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> first_127_dilations_0 = const()[name = tensor<string, []>("first_127_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp32, [192, 1, 5, 5]> x_111_weight_0 = const()[name = tensor<string, []>("x_111_weight_0"), val = tensor<fp32, [192, 1, 5, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1482880)))];
            tensor<fp32, [192]> const_72 = const()[name = tensor<string, []>("const_72"), val = tensor<fp32, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1502144)))];
            tensor<fp32, [1, 192, 60, 60]> x_113 = conv(bias = const_72, dilations = first_127_dilations_0, groups = first_127_groups_0, pad = first_127_pad_0, pad_type = first_127_pad_type_0, strides = first_127_strides_0, weight = x_111_weight_0, x = x_107)[name = tensor<string, []>("x_113")];
            tensor<fp32, []> var_847 = const()[name = tensor<string, []>("op_847"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_848 = const()[name = tensor<string, []>("op_848"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_850 = const()[name = tensor<string, []>("op_850"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [1, 192, 60, 60]> var_851 = mul(x = x_113, y = var_850)[name = tensor<string, []>("op_851")];
            tensor<fp32, []> var_852 = const()[name = tensor<string, []>("op_852"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [1, 192, 60, 60]> var_853 = add(x = var_851, y = var_852)[name = tensor<string, []>("op_853")];
            tensor<fp32, [1, 192, 60, 60]> clip_9 = clip(alpha = var_848, beta = var_847, x = var_853)[name = tensor<string, []>("clip_9")];
            tensor<fp32, [1, 192, 60, 60]> second_115 = mul(x = clip_9, y = x_113)[name = tensor<string, []>("second_115")];
            tensor<fp32, [1, 192, 60, 60]> x_115 = mul(x = initializers_onnx_initializer_57, y = second_115)[name = tensor<string, []>("x_115")];
            tensor<fp32, [1, 192, 60, 60]> x_117 = add(x = x_115, y = initializers_onnx_initializer_58)[name = tensor<string, []>("x_117")];
            tensor<string, []> first_139_pad_type_0 = const()[name = tensor<string, []>("first_139_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> first_139_strides_0 = const()[name = tensor<string, []>("first_139_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> first_139_pad_0 = const()[name = tensor<string, []>("first_139_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> first_139_dilations_0 = const()[name = tensor<string, []>("first_139_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> first_139_groups_0 = const()[name = tensor<string, []>("first_139_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [192, 192, 1, 1]> x_121_weight_0 = const()[name = tensor<string, []>("x_121_weight_0"), val = tensor<fp32, [192, 192, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1502976)))];
            tensor<fp32, [192]> const_73 = const()[name = tensor<string, []>("const_73"), val = tensor<fp32, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1650496)))];
            tensor<fp32, [1, 192, 60, 60]> x_123 = conv(bias = const_73, dilations = first_139_dilations_0, groups = first_139_groups_0, pad = first_139_pad_0, pad_type = first_139_pad_type_0, strides = first_139_strides_0, weight = x_121_weight_0, x = x_117)[name = tensor<string, []>("x_123")];
            tensor<fp32, []> var_885 = const()[name = tensor<string, []>("op_885"), val = tensor<fp32, []>(0x1p+0)];
