program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.11.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios16>(tensor<fp32, [32, 3, 48, 320]> x) {
            tensor<fp32, [120]> initializers_onnx_initializer_218 = const()[name = tensor<string, []>("initializers_onnx_initializer_218"), val = tensor<fp32, [120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp32, [120]> initializers_onnx_initializer_217 = const()[name = tensor<string, []>("initializers_onnx_initializer_217"), val = tensor<fp32, [120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(640)))];
            tensor<fp32, []> initializers_onnx_initializer_216 = const()[name = tensor<string, []>("initializers_onnx_initializer_216"), val = tensor<fp32, []>(0x1.0c6f7ap-20)];
            tensor<fp32, []> initializers_onnx_initializer_215 = const()[name = tensor<string, []>("initializers_onnx_initializer_215"), val = tensor<fp32, []>(0x1p+1)];
            tensor<fp32, [120]> initializers_onnx_initializer_210 = const()[name = tensor<string, []>("initializers_onnx_initializer_210"), val = tensor<fp32, [120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1216)))];
            tensor<fp32, [120]> initializers_onnx_initializer_209 = const()[name = tensor<string, []>("initializers_onnx_initializer_209"), val = tensor<fp32, [120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1792)))];
            tensor<fp32, []> initializers_onnx_initializer_208 = const()[name = tensor<string, []>("initializers_onnx_initializer_208"), val = tensor<fp32, []>(0x1.4f8b58p-17)];
            tensor<fp32, []> initializers_onnx_initializer_207 = const()[name = tensor<string, []>("initializers_onnx_initializer_207"), val = tensor<fp32, []>(0x1p+1)];
            tensor<fp32, [1]> initializers_onnx_initializer_195 = const()[name = tensor<string, []>("initializers_onnx_initializer_195"), val = tensor<fp32, [1]>([0x1.08654ap-2])];
            tensor<fp32, [120]> initializers_onnx_initializer_187 = const()[name = tensor<string, []>("initializers_onnx_initializer_187"), val = tensor<fp32, [120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2368)))];
            tensor<fp32, [120]> initializers_onnx_initializer_186 = const()[name = tensor<string, []>("initializers_onnx_initializer_186"), val = tensor<fp32, [120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2944)))];
            tensor<fp32, []> initializers_onnx_initializer_185 = const()[name = tensor<string, []>("initializers_onnx_initializer_185"), val = tensor<fp32, []>(0x1.4f8b58p-17)];
            tensor<fp32, []> initializers_onnx_initializer_184 = const()[name = tensor<string, []>("initializers_onnx_initializer_184"), val = tensor<fp32, []>(0x1p+1)];
            tensor<fp32, [120]> initializers_onnx_initializer_179 = const()[name = tensor<string, []>("initializers_onnx_initializer_179"), val = tensor<fp32, [120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3520)))];
            tensor<fp32, [120]> initializers_onnx_initializer_178 = const()[name = tensor<string, []>("initializers_onnx_initializer_178"), val = tensor<fp32, [120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4096)))];
            tensor<fp32, []> initializers_onnx_initializer_177 = const()[name = tensor<string, []>("initializers_onnx_initializer_177"), val = tensor<fp32, []>(0x1.4f8b58p-17)];
            tensor<fp32, []> initializers_onnx_initializer_176 = const()[name = tensor<string, []>("initializers_onnx_initializer_176"), val = tensor<fp32, []>(0x1p+1)];
            tensor<fp32, [1]> initializers_onnx_initializer_164 = const()[name = tensor<string, []>("initializers_onnx_initializer_164"), val = tensor<fp32, [1]>([0x1.08654ap-2])];
            tensor<fp32, [120]> initializers_onnx_initializer_156 = const()[name = tensor<string, []>("initializers_onnx_initializer_156"), val = tensor<fp32, [120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4672)))];
            tensor<fp32, [120]> initializers_onnx_initializer_155 = const()[name = tensor<string, []>("initializers_onnx_initializer_155"), val = tensor<fp32, [120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5248)))];
            tensor<fp32, []> initializers_onnx_initializer_154 = const()[name = tensor<string, []>("initializers_onnx_initializer_154"), val = tensor<fp32, []>(0x1.4f8b58p-17)];
            tensor<fp32, []> initializers_onnx_initializer_153 = const()[name = tensor<string, []>("initializers_onnx_initializer_153"), val = tensor<fp32, []>(0x1p+1)];
            tensor<fp32, [1]> initializers_onnx_initializer_143 = const()[name = tensor<string, []>("initializers_onnx_initializer_143"), val = tensor<fp32, [1]>([-0x1.f51604p-2])];
            tensor<fp32, [1]> initializers_onnx_initializer_142 = const()[name = tensor<string, []>("initializers_onnx_initializer_142"), val = tensor<fp32, [1]>([0x1.0839acp+2])];
            tensor<fp32, [1]> initializers_onnx_initializer_138 = const()[name = tensor<string, []>("initializers_onnx_initializer_138"), val = tensor<fp32, [1]>([0x1.d67868p-14])];
            tensor<fp32, [1]> initializers_onnx_initializer_137 = const()[name = tensor<string, []>("initializers_onnx_initializer_137"), val = tensor<fp32, [1]>([0x1.f5e726p-5])];
            tensor<fp32, [1]> initializers_onnx_initializer_133 = const()[name = tensor<string, []>("initializers_onnx_initializer_133"), val = tensor<fp32, [1]>([0x1.ccbafap-4])];
            tensor<fp32, [1]> initializers_onnx_initializer_132 = const()[name = tensor<string, []>("initializers_onnx_initializer_132"), val = tensor<fp32, [1]>([0x1.66192ap-2])];
            tensor<fp32, [1]> initializers_onnx_initializer_128 = const()[name = tensor<string, []>("initializers_onnx_initializer_128"), val = tensor<fp32, [1]>([0x1.53dddp-18])];
            tensor<fp32, [1]> initializers_onnx_initializer_127 = const()[name = tensor<string, []>("initializers_onnx_initializer_127"), val = tensor<fp32, [1]>([0x1.0988b2p-7])];
            tensor<fp32, [1]> initializers_onnx_initializer_123 = const()[name = tensor<string, []>("initializers_onnx_initializer_123"), val = tensor<fp32, [1]>([0x1.6ea31ep-3])];
            tensor<fp32, [1]> initializers_onnx_initializer_122 = const()[name = tensor<string, []>("initializers_onnx_initializer_122"), val = tensor<fp32, [1]>([0x1.35babp-1])];
            tensor<fp32, [1]> initializers_onnx_initializer_116 = const()[name = tensor<string, []>("initializers_onnx_initializer_116"), val = tensor<fp32, [1]>([-0x1.af610ap+0])];
            tensor<fp32, [1]> initializers_onnx_initializer_115 = const()[name = tensor<string, []>("initializers_onnx_initializer_115"), val = tensor<fp32, [1]>([0x1.94ee36p+0])];
            tensor<fp32, [1]> initializers_onnx_initializer_111 = const()[name = tensor<string, []>("initializers_onnx_initializer_111"), val = tensor<fp32, [1]>([0x1.86422p-5])];
            tensor<fp32, [1]> initializers_onnx_initializer_110 = const()[name = tensor<string, []>("initializers_onnx_initializer_110"), val = tensor<fp32, [1]>([0x1.48f3d2p-1])];
            tensor<fp32, [1]> initializers_onnx_initializer_104 = const()[name = tensor<string, []>("initializers_onnx_initializer_104"), val = tensor<fp32, [1]>([-0x1.ff05e2p-1])];
            tensor<fp32, [1]> initializers_onnx_initializer_103 = const()[name = tensor<string, []>("initializers_onnx_initializer_103"), val = tensor<fp32, [1]>([0x1.1a3ffp+0])];
            tensor<fp32, [1]> initializers_onnx_initializer_99 = const()[name = tensor<string, []>("initializers_onnx_initializer_99"), val = tensor<fp32, [1]>([0x1.638f1ep-3])];
            tensor<fp32, [1]> initializers_onnx_initializer_98 = const()[name = tensor<string, []>("initializers_onnx_initializer_98"), val = tensor<fp32, [1]>([0x1.108902p-1])];
            tensor<fp32, [1]> initializers_onnx_initializer_94 = const()[name = tensor<string, []>("initializers_onnx_initializer_94"), val = tensor<fp32, [1]>([-0x1.197dc2p-16])];
            tensor<fp32, [1]> initializers_onnx_initializer_93 = const()[name = tensor<string, []>("initializers_onnx_initializer_93"), val = tensor<fp32, [1]>([0x1.dec192p-7])];
            tensor<fp32, [1]> initializers_onnx_initializer_89 = const()[name = tensor<string, []>("initializers_onnx_initializer_89"), val = tensor<fp32, [1]>([0x1.6d769p-3])];
            tensor<fp32, [1]> initializers_onnx_initializer_88 = const()[name = tensor<string, []>("initializers_onnx_initializer_88"), val = tensor<fp32, [1]>([0x1.3e843ap-1])];
            tensor<fp32, [1]> initializers_onnx_initializer_84 = const()[name = tensor<string, []>("initializers_onnx_initializer_84"), val = tensor<fp32, [1]>([-0x1.4b9c2p-16])];
            tensor<fp32, [1]> initializers_onnx_initializer_83 = const()[name = tensor<string, []>("initializers_onnx_initializer_83"), val = tensor<fp32, [1]>([0x1.e46c1ep-7])];
            tensor<fp32, [1]> initializers_onnx_initializer_79 = const()[name = tensor<string, []>("initializers_onnx_initializer_79"), val = tensor<fp32, [1]>([0x1.44b5bcp-4])];
            tensor<fp32, [1]> initializers_onnx_initializer_78 = const()[name = tensor<string, []>("initializers_onnx_initializer_78"), val = tensor<fp32, [1]>([0x1.16999p-1])];
            tensor<fp32, [1]> initializers_onnx_initializer_74 = const()[name = tensor<string, []>("initializers_onnx_initializer_74"), val = tensor<fp32, [1]>([-0x1.b24ee2p-16])];
            tensor<fp32, [1]> initializers_onnx_initializer_73 = const()[name = tensor<string, []>("initializers_onnx_initializer_73"), val = tensor<fp32, [1]>([0x1.ff4f74p-7])];
            tensor<fp32, [1]> initializers_onnx_initializer_69 = const()[name = tensor<string, []>("initializers_onnx_initializer_69"), val = tensor<fp32, [1]>([-0x1.41d63cp-3])];
            tensor<fp32, [1]> initializers_onnx_initializer_68 = const()[name = tensor<string, []>("initializers_onnx_initializer_68"), val = tensor<fp32, [1]>([0x1.cb6e74p-2])];
            tensor<fp32, [1]> initializers_onnx_initializer_64 = const()[name = tensor<string, []>("initializers_onnx_initializer_64"), val = tensor<fp32, [1]>([-0x1.5701aap-16])];
            tensor<fp32, [1]> initializers_onnx_initializer_63 = const()[name = tensor<string, []>("initializers_onnx_initializer_63"), val = tensor<fp32, [1]>([0x1.dfd004p-7])];
            tensor<fp32, [1]> initializers_onnx_initializer_59 = const()[name = tensor<string, []>("initializers_onnx_initializer_59"), val = tensor<fp32, [1]>([-0x1.06acd4p-2])];
            tensor<fp32, [1]> initializers_onnx_initializer_58 = const()[name = tensor<string, []>("initializers_onnx_initializer_58"), val = tensor<fp32, [1]>([0x1.c8c9ccp-2])];
            tensor<fp32, [1]> initializers_onnx_initializer_54 = const()[name = tensor<string, []>("initializers_onnx_initializer_54"), val = tensor<fp32, [1]>([-0x1.2925bep-21])];
            tensor<fp32, [1]> initializers_onnx_initializer_53 = const()[name = tensor<string, []>("initializers_onnx_initializer_53"), val = tensor<fp32, [1]>([0x1.1d1cf4p-5])];
            tensor<fp32, [1]> initializers_onnx_initializer_49 = const()[name = tensor<string, []>("initializers_onnx_initializer_49"), val = tensor<fp32, [1]>([-0x1.19552cp-6])];
            tensor<fp32, [1]> initializers_onnx_initializer_48 = const()[name = tensor<string, []>("initializers_onnx_initializer_48"), val = tensor<fp32, [1]>([0x1.710decp-2])];
            tensor<fp32, [1]> initializers_onnx_initializer_44 = const()[name = tensor<string, []>("initializers_onnx_initializer_44"), val = tensor<fp32, [1]>([0x1.e14022p-17])];
            tensor<fp32, [1]> initializers_onnx_initializer_43 = const()[name = tensor<string, []>("initializers_onnx_initializer_43"), val = tensor<fp32, [1]>([0x1.81d5b6p-6])];
            tensor<fp32, [1]> initializers_onnx_initializer_39 = const()[name = tensor<string, []>("initializers_onnx_initializer_39"), val = tensor<fp32, [1]>([-0x1.8602fp-2])];
            tensor<fp32, [1]> initializers_onnx_initializer_38 = const()[name = tensor<string, []>("initializers_onnx_initializer_38"), val = tensor<fp32, [1]>([0x1.fa91fcp-3])];
            tensor<fp32, [1]> initializers_onnx_initializer_34 = const()[name = tensor<string, []>("initializers_onnx_initializer_34"), val = tensor<fp32, [1]>([-0x1.1eec24p-17])];
            tensor<fp32, [1]> initializers_onnx_initializer_33 = const()[name = tensor<string, []>("initializers_onnx_initializer_33"), val = tensor<fp32, [1]>([0x1.5c5e0ep-5])];
            tensor<fp32, [1]> initializers_onnx_initializer_29 = const()[name = tensor<string, []>("initializers_onnx_initializer_29"), val = tensor<fp32, [1]>([-0x1.2cf3d4p-3])];
            tensor<fp32, [1]> initializers_onnx_initializer_28 = const()[name = tensor<string, []>("initializers_onnx_initializer_28"), val = tensor<fp32, [1]>([0x1.8e283cp-3])];
            tensor<fp32, [1]> initializers_onnx_initializer_24 = const()[name = tensor<string, []>("initializers_onnx_initializer_24"), val = tensor<fp32, [1]>([0x1.462feep-15])];
            tensor<fp32, [1]> initializers_onnx_initializer_23 = const()[name = tensor<string, []>("initializers_onnx_initializer_23"), val = tensor<fp32, [1]>([0x1.7f2acep-7])];
            tensor<fp32, [1]> initializers_onnx_initializer_19 = const()[name = tensor<string, []>("initializers_onnx_initializer_19"), val = tensor<fp32, [1]>([-0x1.a6864ap-2])];
            tensor<fp32, [1]> initializers_onnx_initializer_18 = const()[name = tensor<string, []>("initializers_onnx_initializer_18"), val = tensor<fp32, [1]>([0x1.49c8f8p-3])];
            tensor<fp32, [1]> initializers_onnx_initializer_14 = const()[name = tensor<string, []>("initializers_onnx_initializer_14"), val = tensor<fp32, [1]>([-0x1.87f5ccp-17])];
            tensor<fp32, [1]> initializers_onnx_initializer_13 = const()[name = tensor<string, []>("initializers_onnx_initializer_13"), val = tensor<fp32, [1]>([0x1.3dbcep-3])];
            tensor<fp32, [1]> initializers_onnx_initializer_9 = const()[name = tensor<string, []>("initializers_onnx_initializer_9"), val = tensor<fp32, [1]>([-0x1.01f50ep-2])];
            tensor<fp32, [1]> initializers_onnx_initializer_8 = const()[name = tensor<string, []>("initializers_onnx_initializer_8"), val = tensor<fp32, [1]>([0x1.308fccp-3])];
            tensor<fp32, [1]> initializers_onnx_initializer_4 = const()[name = tensor<string, []>("initializers_onnx_initializer_4"), val = tensor<fp32, [1]>([0x1.15d54cp-15])];
            tensor<fp32, [1]> initializers_onnx_initializer_3 = const()[name = tensor<string, []>("initializers_onnx_initializer_3"), val = tensor<fp32, [1]>([0x1.e5e99p-7])];
            tensor<fp32, [60, 240, 1, 1]> Conv_22_weight = const()[name = tensor<string, []>("Conv_22_weight"), val = tensor<fp32, [60, 240, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5824)))];
            tensor<fp32, [120, 480, 1, 1]> Conv_26_weight = const()[name = tensor<string, []>("Conv_26_weight"), val = tensor<fp32, [120, 480, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(63488)))];
            tensor<string, []> input_1_pad_type_0 = const()[name = tensor<string, []>("input_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_1_strides_0 = const()[name = tensor<string, []>("input_1_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_1_dilations_0 = const()[name = tensor<string, []>("input_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_1_groups_0 = const()[name = tensor<string, []>("input_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [16, 3, 3, 3]> const_52 = const()[name = tensor<string, []>("const_52"), val = tensor<fp32, [16, 3, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(293952)))];
            tensor<fp32, [16]> const_53 = const()[name = tensor<string, []>("const_53"), val = tensor<fp32, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(295744)))];
            tensor<fp32, [32, 16, 24, 160]> input_3 = conv(bias = const_53, dilations = input_1_dilations_0, groups = input_1_groups_0, pad = input_1_pad_0, pad_type = input_1_pad_type_0, strides = input_1_strides_0, weight = const_52, x = x)[name = tensor<string, []>("input_3")];
            tensor<string, []> first_1_pad_type_0 = const()[name = tensor<string, []>("first_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> first_1_pad_0 = const()[name = tensor<string, []>("first_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> first_1_groups_0 = const()[name = tensor<string, []>("first_1_groups_0"), val = tensor<int32, []>(16)];
            tensor<int32, [2]> first_1_strides_0 = const()[name = tensor<string, []>("first_1_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> first_1_dilations_0 = const()[name = tensor<string, []>("first_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp32, [16, 1, 3, 3]> x_3_weight_0 = const()[name = tensor<string, []>("x_3_weight_0"), val = tensor<fp32, [16, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(295872)))];
            tensor<fp32, [16]> const_64 = const()[name = tensor<string, []>("const_64"), val = tensor<fp32, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(296512)))];
            tensor<fp32, [32, 16, 24, 160]> x_5 = conv(bias = const_64, dilations = first_1_dilations_0, groups = first_1_groups_0, pad = first_1_pad_0, pad_type = first_1_pad_type_0, strides = first_1_strides_0, weight = x_3_weight_0, x = input_3)[name = tensor<string, []>("x_5")];
            tensor<fp32, []> var_508 = const()[name = tensor<string, []>("op_508"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_509 = const()[name = tensor<string, []>("op_509"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_511 = const()[name = tensor<string, []>("op_511"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [32, 16, 24, 160]> var_512 = mul(x = x_5, y = var_511)[name = tensor<string, []>("op_512")];
            tensor<fp32, []> var_513 = const()[name = tensor<string, []>("op_513"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [32, 16, 24, 160]> var_514 = add(x = var_512, y = var_513)[name = tensor<string, []>("op_514")];
            tensor<fp32, [32, 16, 24, 160]> clip_0 = clip(alpha = var_509, beta = var_508, x = var_514)[name = tensor<string, []>("clip_0")];
            tensor<fp32, [32, 16, 24, 160]> second_7 = mul(x = clip_0, y = x_5)[name = tensor<string, []>("second_7")];
            tensor<fp32, [32, 16, 24, 160]> x_7 = mul(x = initializers_onnx_initializer_3, y = second_7)[name = tensor<string, []>("x_7")];
            tensor<fp32, [32, 16, 24, 160]> x_9 = add(x = x_7, y = initializers_onnx_initializer_4)[name = tensor<string, []>("x_9")];
            tensor<string, []> first_13_pad_type_0 = const()[name = tensor<string, []>("first_13_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> first_13_strides_0 = const()[name = tensor<string, []>("first_13_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> first_13_pad_0 = const()[name = tensor<string, []>("first_13_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> first_13_dilations_0 = const()[name = tensor<string, []>("first_13_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> first_13_groups_0 = const()[name = tensor<string, []>("first_13_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [32, 16, 1, 1]> x_13_weight_0 = const()[name = tensor<string, []>("x_13_weight_0"), val = tensor<fp32, [32, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(296640)))];
            tensor<fp32, [32]> const_65 = const()[name = tensor<string, []>("const_65"), val = tensor<fp32, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(298752)))];
            tensor<fp32, [32, 32, 24, 160]> x_15 = conv(bias = const_65, dilations = first_13_dilations_0, groups = first_13_groups_0, pad = first_13_pad_0, pad_type = first_13_pad_type_0, strides = first_13_strides_0, weight = x_13_weight_0, x = x_9)[name = tensor<string, []>("x_15")];
            tensor<fp32, []> var_546 = const()[name = tensor<string, []>("op_546"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_547 = const()[name = tensor<string, []>("op_547"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_549 = const()[name = tensor<string, []>("op_549"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [32, 32, 24, 160]> var_550 = mul(x = x_15, y = var_549)[name = tensor<string, []>("op_550")];
            tensor<fp32, []> var_551 = const()[name = tensor<string, []>("op_551"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [32, 32, 24, 160]> var_552 = add(x = var_550, y = var_551)[name = tensor<string, []>("op_552")];
            tensor<fp32, [32, 32, 24, 160]> clip_1 = clip(alpha = var_547, beta = var_546, x = var_552)[name = tensor<string, []>("clip_1")];
            tensor<fp32, [32, 32, 24, 160]> second_17 = mul(x = clip_1, y = x_15)[name = tensor<string, []>("second_17")];
            tensor<fp32, [32, 32, 24, 160]> x_17 = mul(x = initializers_onnx_initializer_8, y = second_17)[name = tensor<string, []>("x_17")];
            tensor<fp32, [32, 32, 24, 160]> x_19 = add(x = x_17, y = initializers_onnx_initializer_9)[name = tensor<string, []>("x_19")];
            tensor<string, []> first_25_pad_type_0 = const()[name = tensor<string, []>("first_25_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> first_25_pad_0 = const()[name = tensor<string, []>("first_25_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> first_25_groups_0 = const()[name = tensor<string, []>("first_25_groups_0"), val = tensor<int32, []>(32)];
            tensor<int32, [2]> first_25_strides_0 = const()[name = tensor<string, []>("first_25_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> first_25_dilations_0 = const()[name = tensor<string, []>("first_25_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp32, [32, 1, 3, 3]> x_23_weight_0 = const()[name = tensor<string, []>("x_23_weight_0"), val = tensor<fp32, [32, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(298944)))];
            tensor<fp32, [32]> const_66 = const()[name = tensor<string, []>("const_66"), val = tensor<fp32, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(300160)))];
            tensor<fp32, [32, 32, 24, 160]> x_25 = conv(bias = const_66, dilations = first_25_dilations_0, groups = first_25_groups_0, pad = first_25_pad_0, pad_type = first_25_pad_type_0, strides = first_25_strides_0, weight = x_23_weight_0, x = x_19)[name = tensor<string, []>("x_25")];
            tensor<fp32, []> var_585 = const()[name = tensor<string, []>("op_585"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_586 = const()[name = tensor<string, []>("op_586"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_588 = const()[name = tensor<string, []>("op_588"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [32, 32, 24, 160]> var_589 = mul(x = x_25, y = var_588)[name = tensor<string, []>("op_589")];
            tensor<fp32, []> var_590 = const()[name = tensor<string, []>("op_590"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [32, 32, 24, 160]> var_591 = add(x = var_589, y = var_590)[name = tensor<string, []>("op_591")];
            tensor<fp32, [32, 32, 24, 160]> clip_2 = clip(alpha = var_586, beta = var_585, x = var_591)[name = tensor<string, []>("clip_2")];
            tensor<fp32, [32, 32, 24, 160]> second_27 = mul(x = clip_2, y = x_25)[name = tensor<string, []>("second_27")];
            tensor<fp32, [32, 32, 24, 160]> x_27 = mul(x = initializers_onnx_initializer_13, y = second_27)[name = tensor<string, []>("x_27")];
            tensor<fp32, [32, 32, 24, 160]> x_29 = add(x = x_27, y = initializers_onnx_initializer_14)[name = tensor<string, []>("x_29")];
            tensor<string, []> first_37_pad_type_0 = const()[name = tensor<string, []>("first_37_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> first_37_strides_0 = const()[name = tensor<string, []>("first_37_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> first_37_pad_0 = const()[name = tensor<string, []>("first_37_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> first_37_dilations_0 = const()[name = tensor<string, []>("first_37_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> first_37_groups_0 = const()[name = tensor<string, []>("first_37_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [64, 32, 1, 1]> x_33_weight_0 = const()[name = tensor<string, []>("x_33_weight_0"), val = tensor<fp32, [64, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(300352)))];
            tensor<fp32, [64]> const_67 = const()[name = tensor<string, []>("const_67"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(308608)))];
            tensor<fp32, [32, 64, 24, 160]> x_35 = conv(bias = const_67, dilations = first_37_dilations_0, groups = first_37_groups_0, pad = first_37_pad_0, pad_type = first_37_pad_type_0, strides = first_37_strides_0, weight = x_33_weight_0, x = x_29)[name = tensor<string, []>("x_35")];
            tensor<fp32, []> var_623 = const()[name = tensor<string, []>("op_623"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_624 = const()[name = tensor<string, []>("op_624"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_626 = const()[name = tensor<string, []>("op_626"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [32, 64, 24, 160]> var_627 = mul(x = x_35, y = var_626)[name = tensor<string, []>("op_627")];
            tensor<fp32, []> var_628 = const()[name = tensor<string, []>("op_628"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [32, 64, 24, 160]> var_629 = add(x = var_627, y = var_628)[name = tensor<string, []>("op_629")];
            tensor<fp32, [32, 64, 24, 160]> clip_3 = clip(alpha = var_624, beta = var_623, x = var_629)[name = tensor<string, []>("clip_3")];
            tensor<fp32, [32, 64, 24, 160]> second_37 = mul(x = clip_3, y = x_35)[name = tensor<string, []>("second_37")];
            tensor<fp32, [32, 64, 24, 160]> x_37 = mul(x = initializers_onnx_initializer_18, y = second_37)[name = tensor<string, []>("x_37")];
            tensor<fp32, [32, 64, 24, 160]> x_39 = add(x = x_37, y = initializers_onnx_initializer_19)[name = tensor<string, []>("x_39")];
            tensor<string, []> first_49_pad_type_0 = const()[name = tensor<string, []>("first_49_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> first_49_pad_0 = const()[name = tensor<string, []>("first_49_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> first_49_groups_0 = const()[name = tensor<string, []>("first_49_groups_0"), val = tensor<int32, []>(64)];
            tensor<int32, [2]> first_49_strides_0 = const()[name = tensor<string, []>("first_49_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> first_49_dilations_0 = const()[name = tensor<string, []>("first_49_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp32, [64, 1, 3, 3]> x_43_weight_0 = const()[name = tensor<string, []>("x_43_weight_0"), val = tensor<fp32, [64, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(308928)))];
            tensor<fp32, [64]> const_68 = const()[name = tensor<string, []>("const_68"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(311296)))];
            tensor<fp32, [32, 64, 24, 160]> x_45 = conv(bias = const_68, dilations = first_49_dilations_0, groups = first_49_groups_0, pad = first_49_pad_0, pad_type = first_49_pad_type_0, strides = first_49_strides_0, weight = x_43_weight_0, x = x_39)[name = tensor<string, []>("x_45")];
            tensor<fp32, []> var_662 = const()[name = tensor<string, []>("op_662"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_663 = const()[name = tensor<string, []>("op_663"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_665 = const()[name = tensor<string, []>("op_665"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [32, 64, 24, 160]> var_666 = mul(x = x_45, y = var_665)[name = tensor<string, []>("op_666")];
            tensor<fp32, []> var_667 = const()[name = tensor<string, []>("op_667"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [32, 64, 24, 160]> var_668 = add(x = var_666, y = var_667)[name = tensor<string, []>("op_668")];
            tensor<fp32, [32, 64, 24, 160]> clip_4 = clip(alpha = var_663, beta = var_662, x = var_668)[name = tensor<string, []>("clip_4")];
            tensor<fp32, [32, 64, 24, 160]> second_47 = mul(x = clip_4, y = x_45)[name = tensor<string, []>("second_47")];
            tensor<fp32, [32, 64, 24, 160]> x_47 = mul(x = initializers_onnx_initializer_23, y = second_47)[name = tensor<string, []>("x_47")];
            tensor<fp32, [32, 64, 24, 160]> x_49 = add(x = x_47, y = initializers_onnx_initializer_24)[name = tensor<string, []>("x_49")];
            tensor<string, []> first_61_pad_type_0 = const()[name = tensor<string, []>("first_61_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> first_61_strides_0 = const()[name = tensor<string, []>("first_61_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> first_61_pad_0 = const()[name = tensor<string, []>("first_61_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> first_61_dilations_0 = const()[name = tensor<string, []>("first_61_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> first_61_groups_0 = const()[name = tensor<string, []>("first_61_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [64, 64, 1, 1]> x_53_weight_0 = const()[name = tensor<string, []>("x_53_weight_0"), val = tensor<fp32, [64, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(311616)))];
            tensor<fp32, [64]> const_69 = const()[name = tensor<string, []>("const_69"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(328064)))];
            tensor<fp32, [32, 64, 24, 160]> x_55 = conv(bias = const_69, dilations = first_61_dilations_0, groups = first_61_groups_0, pad = first_61_pad_0, pad_type = first_61_pad_type_0, strides = first_61_strides_0, weight = x_53_weight_0, x = x_49)[name = tensor<string, []>("x_55")];
            tensor<fp32, []> var_700 = const()[name = tensor<string, []>("op_700"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_701 = const()[name = tensor<string, []>("op_701"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_703 = const()[name = tensor<string, []>("op_703"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [32, 64, 24, 160]> var_704 = mul(x = x_55, y = var_703)[name = tensor<string, []>("op_704")];
            tensor<fp32, []> var_705 = const()[name = tensor<string, []>("op_705"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [32, 64, 24, 160]> var_706 = add(x = var_704, y = var_705)[name = tensor<string, []>("op_706")];
            tensor<fp32, [32, 64, 24, 160]> clip_5 = clip(alpha = var_701, beta = var_700, x = var_706)[name = tensor<string, []>("clip_5")];
            tensor<fp32, [32, 64, 24, 160]> second_57 = mul(x = clip_5, y = x_55)[name = tensor<string, []>("second_57")];
            tensor<fp32, [32, 64, 24, 160]> x_57 = mul(x = initializers_onnx_initializer_28, y = second_57)[name = tensor<string, []>("x_57")];
            tensor<fp32, [32, 64, 24, 160]> x_59 = add(x = x_57, y = initializers_onnx_initializer_29)[name = tensor<string, []>("x_59")];
            tensor<string, []> first_73_pad_type_0 = const()[name = tensor<string, []>("first_73_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> first_73_pad_0 = const()[name = tensor<string, []>("first_73_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> first_73_strides_0 = const()[name = tensor<string, []>("first_73_strides_0"), val = tensor<int32, [2]>([2, 1])];
            tensor<int32, []> first_73_groups_0 = const()[name = tensor<string, []>("first_73_groups_0"), val = tensor<int32, []>(64)];
            tensor<int32, [2]> first_73_dilations_0 = const()[name = tensor<string, []>("first_73_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp32, [64, 1, 3, 3]> x_63_weight_0 = const()[name = tensor<string, []>("x_63_weight_0"), val = tensor<fp32, [64, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(328384)))];
            tensor<fp32, [64]> const_70 = const()[name = tensor<string, []>("const_70"), val = tensor<fp32, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(330752)))];
            tensor<fp32, [32, 64, 12, 160]> x_65 = conv(bias = const_70, dilations = first_73_dilations_0, groups = first_73_groups_0, pad = first_73_pad_0, pad_type = first_73_pad_type_0, strides = first_73_strides_0, weight = x_63_weight_0, x = x_59)[name = tensor<string, []>("x_65")];
            tensor<fp32, []> var_740 = const()[name = tensor<string, []>("op_740"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_741 = const()[name = tensor<string, []>("op_741"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_743 = const()[name = tensor<string, []>("op_743"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [32, 64, 12, 160]> var_744 = mul(x = x_65, y = var_743)[name = tensor<string, []>("op_744")];
            tensor<fp32, []> var_745 = const()[name = tensor<string, []>("op_745"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [32, 64, 12, 160]> var_746 = add(x = var_744, y = var_745)[name = tensor<string, []>("op_746")];
            tensor<fp32, [32, 64, 12, 160]> clip_6 = clip(alpha = var_741, beta = var_740, x = var_746)[name = tensor<string, []>("clip_6")];
            tensor<fp32, [32, 64, 12, 160]> second_67 = mul(x = clip_6, y = x_65)[name = tensor<string, []>("second_67")];
            tensor<fp32, [32, 64, 12, 160]> x_67 = mul(x = initializers_onnx_initializer_33, y = second_67)[name = tensor<string, []>("x_67")];
            tensor<fp32, [32, 64, 12, 160]> x_69 = add(x = x_67, y = initializers_onnx_initializer_34)[name = tensor<string, []>("x_69")];
            tensor<string, []> first_85_pad_type_0 = const()[name = tensor<string, []>("first_85_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> first_85_strides_0 = const()[name = tensor<string, []>("first_85_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> first_85_pad_0 = const()[name = tensor<string, []>("first_85_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> first_85_dilations_0 = const()[name = tensor<string, []>("first_85_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> first_85_groups_0 = const()[name = tensor<string, []>("first_85_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [128, 64, 1, 1]> x_73_weight_0 = const()[name = tensor<string, []>("x_73_weight_0"), val = tensor<fp32, [128, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(331072)))];
            tensor<fp32, [128]> const_71 = const()[name = tensor<string, []>("const_71"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(363904)))];
            tensor<fp32, [32, 128, 12, 160]> x_75 = conv(bias = const_71, dilations = first_85_dilations_0, groups = first_85_groups_0, pad = first_85_pad_0, pad_type = first_85_pad_type_0, strides = first_85_strides_0, weight = x_73_weight_0, x = x_69)[name = tensor<string, []>("x_75")];
            tensor<fp32, []> var_778 = const()[name = tensor<string, []>("op_778"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_779 = const()[name = tensor<string, []>("op_779"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_781 = const()[name = tensor<string, []>("op_781"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [32, 128, 12, 160]> var_782 = mul(x = x_75, y = var_781)[name = tensor<string, []>("op_782")];
            tensor<fp32, []> var_783 = const()[name = tensor<string, []>("op_783"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [32, 128, 12, 160]> var_784 = add(x = var_782, y = var_783)[name = tensor<string, []>("op_784")];
            tensor<fp32, [32, 128, 12, 160]> clip_7 = clip(alpha = var_779, beta = var_778, x = var_784)[name = tensor<string, []>("clip_7")];
            tensor<fp32, [32, 128, 12, 160]> second_77 = mul(x = clip_7, y = x_75)[name = tensor<string, []>("second_77")];
            tensor<fp32, [32, 128, 12, 160]> x_77 = mul(x = initializers_onnx_initializer_38, y = second_77)[name = tensor<string, []>("x_77")];
            tensor<fp32, [32, 128, 12, 160]> x_79 = add(x = x_77, y = initializers_onnx_initializer_39)[name = tensor<string, []>("x_79")];
            tensor<string, []> first_97_pad_type_0 = const()[name = tensor<string, []>("first_97_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> first_97_pad_0 = const()[name = tensor<string, []>("first_97_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> first_97_groups_0 = const()[name = tensor<string, []>("first_97_groups_0"), val = tensor<int32, []>(128)];
            tensor<int32, [2]> first_97_strides_0 = const()[name = tensor<string, []>("first_97_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> first_97_dilations_0 = const()[name = tensor<string, []>("first_97_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp32, [128, 1, 3, 3]> x_83_weight_0 = const()[name = tensor<string, []>("x_83_weight_0"), val = tensor<fp32, [128, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(364480)))];
            tensor<fp32, [128]> const_72 = const()[name = tensor<string, []>("const_72"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(369152)))];
            tensor<fp32, [32, 128, 12, 160]> x_85 = conv(bias = const_72, dilations = first_97_dilations_0, groups = first_97_groups_0, pad = first_97_pad_0, pad_type = first_97_pad_type_0, strides = first_97_strides_0, weight = x_83_weight_0, x = x_79)[name = tensor<string, []>("x_85")];
            tensor<fp32, []> var_817 = const()[name = tensor<string, []>("op_817"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_818 = const()[name = tensor<string, []>("op_818"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_820 = const()[name = tensor<string, []>("op_820"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [32, 128, 12, 160]> var_821 = mul(x = x_85, y = var_820)[name = tensor<string, []>("op_821")];
            tensor<fp32, []> var_822 = const()[name = tensor<string, []>("op_822"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [32, 128, 12, 160]> var_823 = add(x = var_821, y = var_822)[name = tensor<string, []>("op_823")];
            tensor<fp32, [32, 128, 12, 160]> clip_8 = clip(alpha = var_818, beta = var_817, x = var_823)[name = tensor<string, []>("clip_8")];
            tensor<fp32, [32, 128, 12, 160]> second_87 = mul(x = clip_8, y = x_85)[name = tensor<string, []>("second_87")];
            tensor<fp32, [32, 128, 12, 160]> x_87 = mul(x = initializers_onnx_initializer_43, y = second_87)[name = tensor<string, []>("x_87")];
            tensor<fp32, [32, 128, 12, 160]> x_89 = add(x = x_87, y = initializers_onnx_initializer_44)[name = tensor<string, []>("x_89")];
            tensor<string, []> first_109_pad_type_0 = const()[name = tensor<string, []>("first_109_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> first_109_strides_0 = const()[name = tensor<string, []>("first_109_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> first_109_pad_0 = const()[name = tensor<string, []>("first_109_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> first_109_dilations_0 = const()[name = tensor<string, []>("first_109_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> first_109_groups_0 = const()[name = tensor<string, []>("first_109_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [128, 128, 1, 1]> x_93_weight_0 = const()[name = tensor<string, []>("x_93_weight_0"), val = tensor<fp32, [128, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(369728)))];
            tensor<fp32, [128]> const_73 = const()[name = tensor<string, []>("const_73"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(435328)))];
            tensor<fp32, [32, 128, 12, 160]> x_95 = conv(bias = const_73, dilations = first_109_dilations_0, groups = first_109_groups_0, pad = first_109_pad_0, pad_type = first_109_pad_type_0, strides = first_109_strides_0, weight = x_93_weight_0, x = x_89)[name = tensor<string, []>("x_95")];
            tensor<fp32, []> var_855 = const()[name = tensor<string, []>("op_855"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_856 = const()[name = tensor<string, []>("op_856"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_858 = const()[name = tensor<string, []>("op_858"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [32, 128, 12, 160]> var_859 = mul(x = x_95, y = var_858)[name = tensor<string, []>("op_859")];
            tensor<fp32, []> var_860 = const()[name = tensor<string, []>("op_860"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [32, 128, 12, 160]> var_861 = add(x = var_859, y = var_860)[name = tensor<string, []>("op_861")];
            tensor<fp32, [32, 128, 12, 160]> clip_9 = clip(alpha = var_856, beta = var_855, x = var_861)[name = tensor<string, []>("clip_9")];
            tensor<fp32, [32, 128, 12, 160]> second_97 = mul(x = clip_9, y = x_95)[name = tensor<string, []>("second_97")];
            tensor<fp32, [32, 128, 12, 160]> x_97 = mul(x = initializers_onnx_initializer_48, y = second_97)[name = tensor<string, []>("x_97")];
            tensor<fp32, [32, 128, 12, 160]> x_99 = add(x = x_97, y = initializers_onnx_initializer_49)[name = tensor<string, []>("x_99")];
            tensor<string, []> first_121_pad_type_0 = const()[name = tensor<string, []>("first_121_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> first_121_pad_0 = const()[name = tensor<string, []>("first_121_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> first_121_strides_0 = const()[name = tensor<string, []>("first_121_strides_0"), val = tensor<int32, [2]>([1, 2])];
            tensor<int32, []> first_121_groups_0 = const()[name = tensor<string, []>("first_121_groups_0"), val = tensor<int32, []>(128)];
            tensor<int32, [2]> first_121_dilations_0 = const()[name = tensor<string, []>("first_121_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp32, [128, 1, 3, 3]> x_103_weight_0 = const()[name = tensor<string, []>("x_103_weight_0"), val = tensor<fp32, [128, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(435904)))];
            tensor<fp32, [128]> const_74 = const()[name = tensor<string, []>("const_74"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(440576)))];
            tensor<fp32, [32, 128, 12, 80]> x_105 = conv(bias = const_74, dilations = first_121_dilations_0, groups = first_121_groups_0, pad = first_121_pad_0, pad_type = first_121_pad_type_0, strides = first_121_strides_0, weight = x_103_weight_0, x = x_99)[name = tensor<string, []>("x_105")];
            tensor<fp32, []> var_895 = const()[name = tensor<string, []>("op_895"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_896 = const()[name = tensor<string, []>("op_896"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_898 = const()[name = tensor<string, []>("op_898"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [32, 128, 12, 80]> var_899 = mul(x = x_105, y = var_898)[name = tensor<string, []>("op_899")];
            tensor<fp32, []> var_900 = const()[name = tensor<string, []>("op_900"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [32, 128, 12, 80]> var_901 = add(x = var_899, y = var_900)[name = tensor<string, []>("op_901")];
            tensor<fp32, [32, 128, 12, 80]> clip_10 = clip(alpha = var_896, beta = var_895, x = var_901)[name = tensor<string, []>("clip_10")];
            tensor<fp32, [32, 128, 12, 80]> second_107 = mul(x = clip_10, y = x_105)[name = tensor<string, []>("second_107")];
            tensor<fp32, [32, 128, 12, 80]> x_107 = mul(x = initializers_onnx_initializer_53, y = second_107)[name = tensor<string, []>("x_107")];
            tensor<fp32, [32, 128, 12, 80]> x_109 = add(x = x_107, y = initializers_onnx_initializer_54)[name = tensor<string, []>("x_109")];
            tensor<string, []> first_133_pad_type_0 = const()[name = tensor<string, []>("first_133_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> first_133_strides_0 = const()[name = tensor<string, []>("first_133_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> first_133_pad_0 = const()[name = tensor<string, []>("first_133_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> first_133_dilations_0 = const()[name = tensor<string, []>("first_133_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> first_133_groups_0 = const()[name = tensor<string, []>("first_133_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp32, [240, 128, 1, 1]> x_113_weight_0 = const()[name = tensor<string, []>("x_113_weight_0"), val = tensor<fp32, [240, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(441152)))];
            tensor<fp32, [240]> const_75 = const()[name = tensor<string, []>("const_75"), val = tensor<fp32, [240]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(564096)))];
            tensor<fp32, [32, 240, 12, 80]> x_115 = conv(bias = const_75, dilations = first_133_dilations_0, groups = first_133_groups_0, pad = first_133_pad_0, pad_type = first_133_pad_type_0, strides = first_133_strides_0, weight = x_113_weight_0, x = x_109)[name = tensor<string, []>("x_115")];
            tensor<fp32, []> var_933 = const()[name = tensor<string, []>("op_933"), val = tensor<fp32, []>(0x1p+0)];
            tensor<fp32, []> var_934 = const()[name = tensor<string, []>("op_934"), val = tensor<fp32, []>(0x0p+0)];
            tensor<fp32, []> var_936 = const()[name = tensor<string, []>("op_936"), val = tensor<fp32, []>(0x1.555556p-3)];
            tensor<fp32, [32, 240, 12, 80]> var_937 = mul(x = x_115, y = var_936)[name = tensor<string, []>("op_937")];
            tensor<fp32, []> var_938 = const()[name = tensor<string, []>("op_938"), val = tensor<fp32, []>(0x1p-1)];
            tensor<fp32, [32, 240, 12, 80]> var_939 = add(x = var_937, y = var_938)[name = tensor<string, []>("op_939")];
            tensor<fp32, [32, 240, 12, 80]> clip_11 = clip(alpha = var_934, beta = var_933, x = var_939)[name = tensor<string, []>("clip_11")];
            tensor<fp32, [32, 240, 12, 80]> second_117 = mul(x = clip_11, y = x_115)[name = tensor<string, []>("second_117")];
